#### Imports

In [58]:
import pandas as pd
import sqlite3
pd.set_option('max_colwidth', None)

#### Initiate an empty database

In [59]:
connection = sqlite3.connect(":memory:")

#### Create a table

In [3]:
# CREATE A TABLE
connection.execute('''CREATE TABLE faculty
             (
             id int,
             first_name text,
             last_name text,
             date_of_birth date
             )''')

#### Insert some data

In [4]:
# INSERT DATA
connection.execute('''
INSERT INTO faculty
VALUES ("1", "John", "Smith", "1970-01-02"

)
''')

In [5]:
# TRIVIAL TEST VIA SELECT
result = connection.execute("""
SELECT last_name, date_of_birth

FROM faculty

""")
result.fetchall()

[('Smith', '1970-01-02')]

#### Make the SQL database to a pandas DataFrame

In [6]:
pd.read_sql("""SELECT * FROM faculty""", connection)

   id first_name last_name date_of_birth
0   1       John     Smith    1970-01-02

---

## Cities Database

Download the [Cities Database](http://oxrep.classics.ox.ac.uk/oxrep/docs/Hanson2016/Hanson2016_CitiesDatabase_OxREP.xlsx) of Hanson, J. W. (2016) _Cities Database_ (OXREP databases). Version 1.0. Accessed (date): <http://oxrep.classics.ox.ac.uk/databases/cities/>. DOI: <https://doi.org/10.5287/bodleian:eqapevAn8>

In titles, replace all spaces with underscores and convert case to lowercase.

In [9]:
cities_df

,id,ancient_toponym,modern_toponym,province,country,barrington_atlas_rank,barrington_atlas_reference,start_date,end_date,longitude,latitude,select_bibliography
0,Hanson2016_1,Abae,Kalapodi,Achaea,Greece,4 or 5,55 D3,-600,NaN,22.933333,38.583333,BNP; Hansen 2006; Hansen and Nielsen 2004; PECS; Sear 2006.
1,Hanson2016_2,Acharnae,Acharnes,Achaea,Greece,3,59 B2,-600,NaN,23.734088,38.083473,BNP; DGRG; PECS; Sear 2006.
2,Hanson2016_3,Acraephia,Akraifnio,Achaea,Greece,3,55 E4,-600,NaN,23.219702,38.452606,BNP; DGRG; Hansen and Nielsen 2004; PECS; Sear 2006.
3,Hanson2016_4,Aegina,Aigina,Achaea,Greece,2,59 A3,-600,NaN,23.428500,37.750074,BNP; DGRG; Hansen 2006; Hansen and Nielsen 2004; PECS; Sear 2006.
4,Hanson2016_5,Aegira,Aigeira,Achaea,Greece,3,58 C1,-600,NaN,22.355720,38.147951,DGRG; Hansen and Nielsen 2004.
...,...,...,...,...,...,...,...,...,...,...,...,...
1383,Hanson2016_1384,Pautalia,Kyustendi,Thracia,Bulgaria,3,49 E1,98,NaN,22.680752,42.282517,BNP; DGRG; Jones 1937; PECS; Wilkes 2003b.
1384,Hanson2016_1385,Philippopolis (Thracia),Plovdiv,Thracia,Bulgaria,2,22 B6,-342,NaN,24.750913,42.146652,BNP; Cohen 1995; DGRG; Hansen and Nielsen 2004; Jones 1937; PECS; Sear 2006; Wilkes 2003b.
1385,Hanson2016_1386,Samothrace,Samothrace,Thracia,Greece,3,51 F3,-700,NaN,25.529249,40.500693,BNP; Hansen 2006; Hansen and Nielsen 2004; PECS; Sear 2006.
1386,Hanson2016_1387,Serdica,Sophia,Thracia,Bulgaria,2,21 F7,45,NaN,23.342891,42.722826,BNP; DGRG; Jones 1937; PECS; Sear 2006; Wilkes 2003b.
1387,Hanson2016_1388,Seuthopolis,Kazanlak,Thracia,Bulgaria,4 or 5,22 C6,-400,NaN,25.274047,42.628866,BNP; Cohen 1995; Hansen and Nielsen 2004; PECS; Wilkes 2003b.

In [60]:
# This line resets the memory.
connection = sqlite3.connect(":memory:")

# Read the excel as pandas DataFrame
cities_df = pd.read_excel('Hanson2016_citiesDatabase_OxREP.xlsx', sheet_name = 'cities')

# Turn the DataFrame to SQL
cities_df.to_sql('cities', con = connection, index = False) # Why False?

1388

#### Let's perform a query

In [10]:
pd.read_sql("SELECT * FROM cities", connection).head()

,id,ancient_toponym,modern_toponym,province,country,barrington_atlas_rank,barrington_atlas_reference,start_date,end_date,longitude,latitude,select_bibliography
0,Hanson2016_1,Abae,Kalapodi,Achaea,Greece,4 or 5,55 D3,-600,NaN,22.933333,38.583333,BNP; Hansen 2006; Hansen and Nielsen 2004; PECS; Sear 2006.
1,Hanson2016_2,Acharnae,Acharnes,Achaea,Greece,3,59 B2,-600,NaN,23.734088,38.083473,BNP; DGRG; PECS; Sear 2006.
2,Hanson2016_3,Acraephia,Akraifnio,Achaea,Greece,3,55 E4,-600,NaN,23.219702,38.452606,BNP; DGRG; Hansen and Nielsen 2004; PECS; Sear 2006.
3,Hanson2016_4,Aegina,Aigina,Achaea,Greece,2,59 A3,-600,NaN,23.428500,37.750074,BNP; DGRG; Hansen 2006; Hansen and Nielsen 2004; PECS; Sear 2006.
4,Hanson2016_5,Aegira,Aigeira,Achaea,Greece,3,58 C1,-600,NaN,22.355720,38.147951,DGRG; Hansen and Nielsen 2004.

#### `WHERE`

In [11]:
pd.read_sql("""

SELECT id, ancient_toponym, modern_toponym, province, country, start_date, end_date

FROM cities

WHERE province LIKE '%Maced%'

""", connection)

,id,ancient_toponym,modern_toponym,province,country,start_date,end_date
0,Hanson2016_1146,Amantia,Klos,Macedonia,Albania,-600,None
1,Hanson2016_1147,Amphipolis,Amfipoli,Macedonia,Greece,-437,None
2,Hanson2016_1148,Apollonia (Macedonia),Pojani,Macedonia,Albania,-588,None
3,Hanson2016_1149,Beroea (Macedonia),Veria,Macedonia,Greece,-400,None
4,Hanson2016_1150,Byllis,Gradisht,Macedonia,Albania,-400,None
5,Hanson2016_1151,Cassandrea,Cassandrea,Macedonia,Greece,-600,None
6,Hanson2016_1152,Dium,Dion,Macedonia,Greece,-400,None
7,Hanson2016_1153,Dyrrachium,Durrës,Macedonia,Albania,-627,None
8,Hanson2016_1154,Edessa,Edessa,Macedonia,Greece,-600,None
9,Hanson2016_1155,Heraclea (Macedonia),Bitola,Macedonia,Macedonia,-359,None
10,Hanson2016_1156,Lychnidus,Ochrid,Macedonia,Macedonia,-600,None
11,Hanson2016_1157,Neapolis (Macedonia),Kavala,Macedonia,Greece,-650,None
12,Hanson2016_1158,Pella (Macedonia),Pella,Macedonia,Greece,-413,None
13,Hanson2016_1159,Philippi,Krenides,Macedonia,Greece,-360,None
14,Hanson2016_1160,Stobi,Stobi,Macedonia,Macedonia,-229,None
15,Hanson2016_1161,Thasos,Thasos,Macedonia,Greece,-700,None
16,Hanson2016_1162,Thessalonica,Thessaloniki,Macedonia,Greece,-316,None
17,Hanson2016_1163,Torone,Toroni,Macedonia,Greece,-400,None

#### `AND`

In [12]:
pd.read_sql("""

SELECT id, ancient_toponym, modern_toponym, province, country, start_date, end_date

FROM cities

WHERE province = 'Macedonia'

AND start_date > -323



""", connection)

,id,ancient_toponym,modern_toponym,province,country,start_date,end_date
0,Hanson2016_1160,Stobi,Stobi,Macedonia,Macedonia,-229,None
1,Hanson2016_1162,Thessalonica,Thessaloniki,Macedonia,Greece,-316,None

#### What is NULL?

In [13]:
pd.read_sql("""

SELECT id, ancient_toponym, modern_toponym, province, country, start_date, end_date

FROM cities

WHERE province = 'Macedonia'

AND end_date IS NULL


""", connection).head()

,id,ancient_toponym,modern_toponym,province,country,start_date,end_date
0,Hanson2016_1146,Amantia,Klos,Macedonia,Albania,-600,None
1,Hanson2016_1147,Amphipolis,Amfipoli,Macedonia,Greece,-437,None
2,Hanson2016_1148,Apollonia (Macedonia),Pojani,Macedonia,Albania,-588,None
3,Hanson2016_1149,Beroea (Macedonia),Veria,Macedonia,Greece,-400,None
4,Hanson2016_1150,Byllis,Gradisht,Macedonia,Albania,-400,None

#### Subquery: Find all cities older than Torone in Macedonia

In [14]:
pd.read_sql("""

SELECT id, ancient_toponym, modern_toponym, province, country, start_date, end_date

FROM cities

WHERE province = 'Macedonia'

AND start_date <= (

SELECT start_date

FROM cities

WHERE ancient_toponym = "Torone"

)

""", connection)

,id,ancient_toponym,modern_toponym,province,country,start_date,end_date
0,Hanson2016_1146,Amantia,Klos,Macedonia,Albania,-600,None
1,Hanson2016_1147,Amphipolis,Amfipoli,Macedonia,Greece,-437,None
2,Hanson2016_1148,Apollonia (Macedonia),Pojani,Macedonia,Albania,-588,None
3,Hanson2016_1149,Beroea (Macedonia),Veria,Macedonia,Greece,-400,None
4,Hanson2016_1150,Byllis,Gradisht,Macedonia,Albania,-400,None
5,Hanson2016_1151,Cassandrea,Cassandrea,Macedonia,Greece,-600,None
6,Hanson2016_1152,Dium,Dion,Macedonia,Greece,-400,None
7,Hanson2016_1153,Dyrrachium,Durrës,Macedonia,Albania,-627,None
8,Hanson2016_1154,Edessa,Edessa,Macedonia,Greece,-600,None
9,Hanson2016_1156,Lychnidus,Ochrid,Macedonia,Macedonia,-600,None
10,Hanson2016_1157,Neapolis (Macedonia),Kavala,Macedonia,Greece,-650,None
11,Hanson2016_1158,Pella (Macedonia),Pella,Macedonia,Greece,-413,None
12,Hanson2016_1161,Thasos,Thasos,Macedonia,Greece,-700,None
13,Hanson2016_1163,Torone,Toroni,Macedonia,Greece,-400,None

#### Let's select all countries where there were ancient cities

In [15]:
pd.read_sql("""

SELECT country

FROM cities



""", connection)

       country
0       Greece
1       Greece
2       Greece
3       Greece
4       Greece
...        ...
1383  Bulgaria
1384  Bulgaria
1385    Greece
1386  Bulgaria
1387  Bulgaria

[1388 rows x 1 columns]

#### ` ORDER BY`

In [16]:
pd.read_sql("""

SELECT country

FROM cities

ORDER BY country

""", connection)

             country
0            Albania
1            Albania
2            Albania
3            Albania
4            Albania
...              ...
1383  United Kingdom
1384  United Kingdom
1385  United Kingdom
1386  United Kingdom
1387  United Kingdom

[1388 rows x 1 columns]

#### `DISTINCT`

In [17]:
pd.read_sql("""

SELECT DISTINCT country

FROM cities

ORDER BY country

""", connection)

                   country
0                  Albania
1                  Algeria
2                  Austria
3                  Belgium
4   Bosnia and Herzegovina
5                 Bulgaria
6                  Croatia
7                   Cyprus
8                    Egypt
9                   France
10                 Germany
11                  Greece
12                 Hungary
13                  Israel
14                   Italy
15                  Jordan
16                  Kosovo
17                 Lebanon
18                   Libya
19               Macedonia
20                   Malta
21              Montenegro
22                 Morocco
23             Netherlands
24         Northern Cyprus
25                Portugal
26                 Romania
27                  Serbia
28                Slovenia
29                   Spain
30             Switzerland
31                   Syria
32                 Tunisia
33                  Turkey
34          United Kingdom

#### Exercise: Find all the countries that have cities on ancient Macedonia

In [18]:
pd.read_sql("""

SELECT DISTINCT country

FROM cities

WHERE province = 'Macedonia'


""", connection)

     country
0    Albania
1     Greece
2  Macedonia

#### Exercise: Find all provinces eastern than Athens (Athenae) that have cities are newer than Athens

In [19]:
pd.read_sql("""

SELECT DISTINCT province

FROM cities

WHERE latitude < (

SELECT latitude

FROM cities

WHERE ancient_toponym = 'Athenae'

)

AND start_date > (

SELECT start_date

FROM cities

WHERE ancient_toponym = 'Athenae'

)

""", connection)

                   province
0                    Achaea
1                  Aegyptus
2      Africa Proconsularis
3                    Arabia
4                      Asia
5                   Baetica
6     Cappadocia et Galatia
7         Cilicia et Cyprus
8        Creta et Cyrenaica
9    Hispania Tarraconensis
10                Lusitania
11       Lycia et Pamphylia
12  Mauretania Caesariensis
13     Mauretania Tingitana
14                  Numidia
15                  Silicia
16                    Syria
17          Syria Palestina

#### Exercise: Count all provinces eastern than Athens (Athenae) that have cities are newer than Athens

In [20]:
pd.read_sql("""

SELECT DISTINCT province, count(*) as count

FROM cities

WHERE latitude < (

SELECT latitude

FROM cities

WHERE ancient_toponym = 'Athenae'

)

AND start_date > (

SELECT start_date

FROM cities

WHERE ancient_toponym = 'Athenae'

)

GROUP BY province


""", connection)

                   province  count
0                    Achaea     33
1                  Aegyptus     47
2      Africa Proconsularis     66
3                    Arabia     14
4                      Asia     36
5                   Baetica     45
6     Cappadocia et Galatia      5
7         Cilicia et Cyprus     35
8        Creta et Cyrenaica     18
9    Hispania Tarraconensis      3
10                Lusitania      3
11       Lycia et Pamphylia     48
12  Mauretania Caesariensis     33
13     Mauretania Tingitana      8
14                  Numidia     29
15                  Silicia     19
16                    Syria     26
17          Syria Palestina     20

#### Read the sheet _monuments_ of Hanson2016_citiesDatabase_OxREP

In [61]:
monuments_df = pd.read_excel('Hanson2016_citiesDatabase_OxREP.xlsx', sheet_name = 'monuments')

monuments_df.to_sql('monuments', con = connection, index = False)

pd.read_sql("SELECT * FROM monuments", connection).head(2)

             id  structure
0  Hanson2016_1  Acropolis
1  Hanson2016_1      Agora

Notice that we are not creating a new connection

In [47]:
pd.read_sql("""

SELECT cities.ancient_toponym, monuments.structure

FROM monuments

JOIN cities ON cities.id = monuments.id


""", connection)

     ancient_toponym           structure
0               Abae           Acropolis
1               Abae               Agora
2               Abae    Temple of Apollo
3               Abae             Theatre
4               Abae               Walls
...              ...                 ...
9466     Seuthopolis  Temple of Dionysus
9467     Seuthopolis          Urban grid
9468     Seuthopolis               Walls
9469         Bararus             Theatre
9470       Aventicum             Theatre

[9471 rows x 2 columns]

#### Exercise create an ordered list with the city of each province that has the most monuments along with the counts of the monuments

In [62]:
exercise_df = pd.read_sql("""

SELECT cities.ancient_toponym, cities.province, monuments.structure

FROM monuments

JOIN cities ON cities.id = monuments.id

""", connection)

In [63]:
exercise_df.to_sql('exercise', con = connection, index = False)
pd.read_sql("SELECT * FROM exercise", connection).head(2)

  ancient_toponym province  structure
0            Abae   Achaea  Acropolis
1            Abae   Achaea      Agora

In [72]:
pd.read_sql("""

SELECT MAX(count)

FROM

(SELECT DISTINCT ancient_toponym, province, count(*) as count

FROM exercise

GROUP BY ancient_toponym

ORDER BY count DESC)


""", connection)

               province  MAX(count)
0  Italia (VII Etruria)         236

#### What about `iloc` and `loc`?